"""
    * Создайте список из чисел 3, 5, 7, 9 и 10.5
    * Выведите содержимое списка на экран
    * Добавьте в конец списка строку "Python"
    * Выведите длину списка на экран

    * Выведите на экран начальный элемент списка
    * Выведите на экран последний элемент списка
    * Напечатайте элементы списка со второго по четвертый включительно
    * Удалите из списка строку "Python"
"""


def main():
    lis = [3, 5, 7, 9, 10.5]
    print(lis)
    lis.append('Python')
    print(len(lis))

    print(lis[0])
    print(lis[-1])
    print(lis[1:4])
    del lis[lis.index('Python')]



if __name__ == "__main__":
    main()